#### groupby()
    - groupby("컬럼명").count() or groupby("컬럼명").agg(function)

In [10]:
import pandas as pd
import seaborn as sns
import numpy as np

In [2]:
mpg_df = sns.load_dataset("mpg")
mpg_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           398 non-null    float64
 1   cylinders     398 non-null    int64
 2   displacement  398 non-null    float64
 3   horsepower    392 non-null    float64
 4   weight        398 non-null    int64
 5   acceleration  398 non-null    float64
 6   model_year    398 non-null    int64
 7   origin        398 non-null    object
 8   name          398 non-null    object
dtypes: float64(4), int64(3), object(2)
memory usage: 28.1+ KB

In [3]:
# orgin 컬럼 기준으로 size()
mpg_df.groupby("origin").size()

origin
europe     70
japan      79
usa       249
dtype: int64

In [4]:
mpg_df["origin"].value_counts()

origin
usa       249
japan      79
europe     70
Name: count, dtype: int64

In [7]:
# orgin 컬럼 기준으로 평균
mpg_df.groupby("origin")["cylinders"].mean()
mpg_df.groupby("origin")["cylinders"].agg("mean")
mpg_df.groupby("origin")["cylinders"].agg(["mean","std","count"])

            mean       std  count
origin
europe  4.157143  0.500310     70
japan   4.101266  0.590414     79
usa     6.248996  1.661425    249

In [8]:
mpg_df.groupby(["model_year","origin"])["cylinders"].mean()

model_year  origin
70          europe    4.000000
            japan     4.000000
            usa       7.636364
71          europe    4.000000
            japan     4.000000
            usa       6.200000
72          europe    4.000000
            japan     3.800000
            usa       6.888889
73          europe    4.000000
            japan     4.250000
            usa       7.241379
74          europe    4.000000
            japan     4.000000
            usa       6.266667
75          europe    4.000000
            japan     4.000000
            usa       6.400000
76          europe    4.250000
            japan     4.500000
            usa       6.363636
77          europe    4.000000
            japan     4.166667
            usa       6.222222
78          europe    4.833333
            japan     4.000000
            usa       6.000000
79          europe    4.250000
            japan     4.000000
            usa       6.260870
80          europe    4.111111
            japan     4.076923
            usa       4.285714
81          europe    4.500000
            japan     4.333333
            usa       4.923077
82          europe    4.000000
            japan     4.000000
            usa       4.300000
Name: cylinders, dtype: float64

In [9]:
mpg_df.describe()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year
count,398.000000,398.000000,398.000000,392.000000,398.000000,398.000000,398.000000
mean,23.514573,5.454774,193.425879,104.469388,2970.424623,15.568090,76.010050
std,7.815984,1.701004,104.269838,38.491160,846.841774,2.757689,3.697627
min,9.000000,3.000000,68.000000,46.000000,1613.000000,8.000000,70.000000
25%,17.500000,4.000000,104.250000,75.000000,2223.750000,13.825000,73.000000
50%,23.000000,4.000000,148.500000,93.500000,2803.500000,15.500000,76.000000
75%,29.000000,8.000000,262.000000,126.000000,3608.000000,17.175000,79.000000
max,46.600000,8.000000,455.000000,230.000000,5140.000000,24.800000,82.000000

In [11]:
df = pd.DataFrame(
    {
        "A":["ha","hi","ho","ha","ho"],
        "B":["one","two","one","one","two"],
        "Data1":np.random.random(5),
        "Data2":np.random.random(5)
    }
)
df

    A    B     Data1     Data2
0  ha  one  0.190092  0.390519
1  hi  two  0.970071  0.477357
2  ho  one  0.893658  0.494485
3  ha  one  0.434637  0.694311
4  ho  two  0.746863  0.710059

In [12]:
# A열 기준으로 그룹,sum()
df.groupby("A").sum()

         B     Data1     Data2
A
ha  oneone  0.624729  1.084829
hi     two  0.970071  0.477357
ho  onetwo  1.640522  1.204544

In [14]:
df.groupby("A")[["Data1","Data2"]]\
    .agg(["sum","mean","std"])\
.rename(columns={"sum":"합계","mean":"평균","std":"표준편차"})

       Data1                         Data2
          합계        평균      표준편차        합계        평균      표준편차
A
ha  0.624729  0.312365  0.172919  1.084829  0.542415  0.214814
hi  0.970071  0.970071       NaN  0.477357  0.477357       NaN
ho  1.640522  0.820261  0.103800  1.204544  0.602272  0.152434

In [15]:
student_list = {
    "name" :["John","Nate","Edward","Zara","Wendy","Nate","Brian","Janny","Jeniffer","Sera"],
    "major":["Computer Science","Computer Science","Physics","Psycholgy","Economics","Economics","Phychology","Computer Science","Psycholgy","Economics"],
    "gender":["male","male","male","female","female","male","male","male","male","female"]
}

df = pd.DataFrame(student_list)
df

       name             major  gender
0      John  Computer Science    male
1      Nate  Computer Science    male
2    Edward           Physics    male
3      Zara         Psycholgy  female
4     Wendy         Economics  female
5      Nate         Economics    male
6     Brian        Phychology    male
7     Janny  Computer Science    male
8  Jeniffer         Psycholgy    male
9      Sera         Economics  female

In [16]:
groupby_major=df.groupby("major")
groupby_major.groups

{'Computer Science': [0, 1, 7], 'Economics': [4, 5, 9], 'Phychology': [6], 'Physics': [2], 'Psycholgy': [3, 8]}

In [17]:
for name, group in groupby_major:
    print(f"{name}:{len(group)}")
    print(group)

Computer Science:3
    name             major gender
0   John  Computer Science   male
1   Nate  Computer Science   male
7  Janny  Computer Science   male
Economics:3
    name      major  gender
4  Wendy  Economics  female
5   Nate  Economics    male
9   Sera  Economics  female
Phychology:1
    name       major gender
6  Brian  Phychology   male
Physics:1
     name    major gender
2  Edward  Physics   male
Psycholgy:2
       name      major  gender
3      Zara  Psycholgy  female
8  Jeniffer  Psycholgy    male

In [18]:
groupby_major.size()

major
Computer Science    3
Economics           3
Phychology          1
Physics             1
Psycholgy           2
dtype: int64

In [19]:
# 시리즈 =>df

major_df = pd.DataFrame({"count":groupby_major.size()})
major_df

                  count
major
Computer Science      3
Economics             3
Phychology            1
Physics               1
Psycholgy             2

In [20]:
major_df.reset_index()

              major  count
0  Computer Science      3
1         Economics      3
2        Phychology      1
3           Physics      1
4         Psycholgy      2

In [21]:
df= pd.DataFrame(
    {
        "School":["Yeonhi","Yeonhi","Sungsan","Sungsan","Sungsan"],
        "Name":["Haena","Gisu","Una","Naeun","Ziho"],
        "Math":[92,70,88,92,70]
    }
)
df

    School   Name  Math
0   Yeonhi  Haena    92
1   Yeonhi   Gisu    70
2  Sungsan    Una    88
3  Sungsan  Naeun    92
4  Sungsan   Ziho    70

In [27]:
# school 그룹/ Math 평균 구하기
# 시리즈 => 데이터프레임
# 1) pd.DataFrame(시리즈)
# 2) reset_index()

df_avg=df.groupby("School")["Math"].mean().reset_index().rename(columns={"Math":"Avg"})
df_avg

    School        Avg
0  Sungsan  83.333333
1   Yeonhi  81.000000

In [29]:
# df + df_avg => merge()

df["Avg"] = df.groupby("School")["Math"].transform("mean")
df

    School   Name  Math        Avg
0   Yeonhi  Haena    92  81.000000
1   Yeonhi   Gisu    70  81.000000
2  Sungsan    Una    88  83.333333
3  Sungsan  Naeun    92  83.333333
4  Sungsan   Ziho    70  83.333333

#### apply()

In [30]:
def grade(num):
    if num > 90:
        grade = "A"
    elif num>80:
        grade="B"
    elif num>70:
        grade="C"
    else:
        grade="F"
    return grade

In [33]:
df["grade"]=df["Math"].apply(grade)
df

    School   Name  Math        Avg grade
0   Yeonhi  Haena    92  81.000000     A
1   Yeonhi   Gisu    70  81.000000     F
2  Sungsan    Una    88  83.333333     B
3  Sungsan  Naeun    92  83.333333     A
4  Sungsan   Ziho    70  83.333333     F

In [34]:
dates = {"yyyy-mm-dd":["2005-09-28","2007-10-05","2012-12-20"]}
df = pd.DataFrame(dates)
df

   yyyy-mm-dd
0  2005-09-28
1  2007-10-05
2  2012-12-20

In [35]:
# 년도만 잘라서 year 컬럼 생성

def extract_year(col):
    return col.split("-")[0]

In [36]:
"2024-10-9".split("-")

['2024', '10', '9']

In [38]:
df["year"] = df["yyyy-mm-dd"].apply(extract_year)
df

   yyyy-mm-dd  year
0  2005-09-28  2005
1  2007-10-05  2007
2  2012-12-20  2012

In [39]:
# 나이 :2025-2005

def get_age(year,current_year =2025):
    return current_year - int(year)

In [40]:
df['age'] = df['year'].apply(get_age)
df

   yyyy-mm-dd  year  age
0  2005-09-28  2005   20
1  2007-10-05  2007   18
2  2012-12-20  2012   13

In [44]:
# 함수 : 나는 20살 입니다.
def get_introduce(row):
    return f"나는 {row.year}년에 태어났고 {row.age}살 입니다."

In [ ]:
df['introduce'] = df["age"].apply(get_introduce)
df

In [46]:
def func(df):
    print(type(df))
    print(df.index)
    print(df.value)

In [ ]:
df.apply(func)

In [ ]:
df.apply(func,axis=1)